codeigniter/app/Controllers/Home.php

    public function dashboard()
    {
        if (!$this->session->has('user')) {
            return redirect()->to('/login');
        }
        $user_model = new UserModel();
        $users = $user_model->findAll();
---
SELECT *
FROM `users`

    public function signup()
    {
        if ($this->session->has('user')) {
            return redirect()->to('/dashboard');
        }
        if (isset($_POST['name'])) {
            $user_model = new UserModel();
            $data = [
                'uuid' => $this->request->getpost('uuid'),
                'name' => $this->request->getPost('name'),
                'email' => $this->request->getPost('email'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT)
            ];
            $result = $user_model->save($data);
---
INSERT INTO `users` (`uuid`, `name`, `email`, `password`) VALUES ('321213', 'Farhaan', 'farhaanchaudhary777@gmail.com', '$2y$10$Ui6kIo7ohbAYjO.Tt3L/SecE/pMP6W87jcCqIrd/5dCrW5Q3w1STa')

    public function login()
    {
        if ($this->session->has('user')) {
            return redirect()->to('/dashboard');
        }
        if (isset($_POST['email'])) {
            $user_model = new UserModel();
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $user = $user_model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'farhaanchaudhary777@gmail.com'
 LIMIT 1

    public function deleteUser($id, $uuid)
    {
        $user_model = new UserModel();

        // Check if user exists
        $user = $user_model->find($id); // Or however you check for the user existence
        if (!$user) {
            return redirect()->to('/dashboard')->with('error', 'User not found');
        }

        // Delete the user from the database
        $result = $user_model->delete($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '530'
DELETE FROM `users`
WHERE `id` IN ('530')

    private function lookupcsv($filePath)
    {
        $csv = fopen($filePath, 'r');
        $user_model = new UserModel();
        $invalidRows = [];
        $validUserData = [];
        $header = fgetcsv($csv);
        while (($row = fgetcsv($csv)) !== false) {
            $uuid = $row[0];
            $name = $row[1];
            $email = $row[2];
            $password = $row[3];
            if (empty($uuid) || empty($name) || empty($email) || empty($password)) {
                $invalidRows[] = $row;
                continue;
            }
            $passwordHash = password_hash($password, PASSWORD_BCRYPT);
            $data = [
                'uuid' => $uuid,
                'name' => $name,
                'email' => $email,
                'password' => $passwordHash,
            ];
            $existingUser = $user_model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'farru@gmail.com'
 LIMIT 1

            $this->syncMongoDB($data);
        }
        if (!empty($validUserData)) {
            $user_model->insertBatch($validUserData);
---
INSERT INTO `users` (`email`, `name`, `password`, `uuid`)
VALUES ('farru@gmail.com','farru','$2y$10$I1FaVnyDzedUkAPgYSenuu26zOR3ta/dhkOoXqfjuAr1a7P9kyxxe','123321'), ('ibtesam@gmail.com','ibtesam','$2y$10$DSnxisc26AzFp8rlATpi3e6jhflW1a7QBzTnmPr2scSpwh51dM.Du','456654'), ('sadaan@gmail.com','sadaan','$2y$10$TXtBzdZbN/4rPRpmxX494OjUpsY6DtkLMi5Ef6GuQS8sdEC8AIY3G','789987'), ('arbaz@gmail.com','arbaz','$2y$10$vuyQjyOweSjlAe1Nbmlqdu5svgqEeKfZUPK8dqLHKlC7SvVOan8am','159951'), ('hamza@gmail.com','hamza','$2y$10$zAWWwxFJqnC5xhaAxpF4yeeYtxVSuDcF.L/I6DESSA/GPbUluDBpy','753357')