codeigniter/app/Controllers/Home.php

    public function deleteUser($id, $uuid)
    {
        $user_model = new UserModel();

        // Check if user exists
        $user = $user_model->find($id); // Or however you check for the user existence
        if (!$user) {
            return redirect()->to('/dashboard')->with('error', 'User not found');
        }

        // Delete the user from the database
        $result = $user_model->delete($id);

        if ($result) {
            try {
                // External service deletion
                $client = new Client();
                $response = $client->delete("http://localhost:3000/api/deleteuser/$uuid");
---
DELETE FROM `users`
WHERE `uuid` = '321213'